Revit 2027 API
BuiltInFailures.ZoneFailures.ZonesOverlapWarning Property
 Zone overlap to another zone or another room.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZonesOverlapWarning { get; }
Public Shared ReadOnly Property ZonesOverlapWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZonesOverlapWarning {
	FailureDefinitionId^ get ();
}
static member ZonesOverlapWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace